Revit 2026 API

# ElementDocument Property

---

Returns the Document in which the Element resides.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document Document { get; }
```
```vb
Public ReadOnly Property Document As Document
	Get
```
```cpp
public:
property Document^ Document {
	Document^ get ();
}
```
```fsharp
member Document : Document with get
```

#### Property Value

Document

All elements are contained within a document. An element can be retrieved from this document by using the id that is returned by the element's id property.

#### Reference

Element Class

Autodesk.Revit.DB Namespace